Bifurcations/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      meshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// path tp the surface mesh
// relative from case or absolute

surfaceFile "constant/triSurface/patched.stl";

// maximum cell size in the mesh (mandatory)
maxCellSize 1.0; // [m]

renameBoundary
{
    newPatchNames
    {
        patch0 { newName vesselWall; type wall;}
        patch1 { newName outlet1; type patch;}
        patch2 { newName outlet2; type patch;}
        patch3 { newName outlet3; type patch;}
        patch4 { newName outlet4; type patch;}
        patch5 { newName inlet; type patch;}
    }
    defaultName walls;
    defaultType wall;
}

boundaryCellSize 0.3;
boundaryCellSizeRefinementThickness 1.0;
minCellSize 0.2;

//localRefinement
//{
//    patch1 { additionalRefinementLevels 1; refinementThickness 1.0; }
//    patch2 { additionalRefinementLevels 1; refinementThickness 1.0; }
//    patch3 { additionalRefinementLevels 1; refinementThickness 1.0; }
//    patch4 { additionalRefinementLevels 1; refinementThickness 1.0; }
//    patch5 { additionalRefinementLevels 1; refinementThickness 1.0; }
//}

boundaryLayers
{
    patchBoundaryLayers
    {
      patch0
      {
          nLayers 5; //not mandatory; default values are either 1 or 0
          thicknessRatio 1.2; //not mandatory; default value is 1
          maxFirstLayerThickness 0.5;  //optional
          allowDiscontinuity 1;
      }
    }
    optimiseLayer 1;
    //untangleLayers 0; // gets rid of negative cell volume; active by default

    optimisationParameters
    {
          //nSmoothNormals 3; //optional; default is 5
          //maxNumIterations 10; //optional; default value is 5
          //featureSizeFactor 0.4; //optional; default is 0.3
          //recalculationNormals 1; //optional; active by default 
          //reThicknessTol 0.1; //optional; 
    }
}

meshQualitySettings
{
    maxNonOrthogonality 55;
}
